In [3]:
import numpy as np

In [4]:
import pandas as pd

In [5]:
from numpy.random import randn

In [6]:
np.random.seed(101)

In [7]:
df = pd.DataFrame(randn(5,4),['a','b','c','d','e'],['w','x','y','z'])

In [8]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [9]:
df['w']

a    2.706850
b    0.651118
c   -2.018168
d    0.188695
e    0.190794
Name: w, dtype: float64

In [10]:
type(df['w'])

pandas.core.series.Series

In [11]:
type(df)

pandas.core.frame.DataFrame

In [12]:
df[['w','x']]

          w         x
a  2.706850  0.628133
b  0.651118 -0.319318
c -2.018168  0.740122
d  0.188695 -0.758872
e  0.190794  1.978757

In [13]:
df['new'] = df['w'] + df['x']

In [14]:
df

          w         x         y         z       new
a  2.706850  0.628133  0.907969  0.503826  3.334983
b  0.651118 -0.319318 -0.848077  0.605965  0.331800
c -2.018168  0.740122  0.528813 -0.589001 -1.278046
d  0.188695 -0.758872 -0.933237  0.955057 -0.570177
e  0.190794  1.978757  2.605967  0.683509  2.169552

In [15]:
df.drop('new',axis = 1)

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [16]:
df.drop('w', axis=1 )

          x         y         z       new
a  0.628133  0.907969  0.503826  3.334983
b -0.319318 -0.848077  0.605965  0.331800
c  0.740122  0.528813 -0.589001 -1.278046
d -0.758872 -0.933237  0.955057 -0.570177
e  1.978757  2.605967  0.683509  2.169552

In [17]:
df.shape

(5, 5)

In [18]:
df

          w         x         y         z       new
a  2.706850  0.628133  0.907969  0.503826  3.334983
b  0.651118 -0.319318 -0.848077  0.605965  0.331800
c -2.018168  0.740122  0.528813 -0.589001 -1.278046
d  0.188695 -0.758872 -0.933237  0.955057 -0.570177
e  0.190794  1.978757  2.605967  0.683509  2.169552

In [19]:
df.loc['c']

w     -2.018168
x      0.740122
y      0.528813
z     -0.589001
new   -1.278046
Name: c, dtype: float64

In [20]:
#df.loc[['A','B'],['W','Y']]

In [21]:
df > 0

       w      x      y      z    new
a   True   True   True   True   True
b   True  False  False   True   True
c  False   True   True  False  False
d   True  False  False   True  False
e   True   True   True   True   True

In [22]:
df[(df['w']> 0) & (df['y']> 1)]

          w         x         y         z       new
e  0.190794  1.978757  2.605967  0.683509  2.169552

In [23]:
df['w']> 0

a     True
b     True
c    False
d     True
e     True
Name: w, dtype: bool

In [24]:
df.reset_index()

  index         w         x         y         z       new
0     a  2.706850  0.628133  0.907969  0.503826  3.334983
1     b  0.651118 -0.319318 -0.848077  0.605965  0.331800
2     c -2.018168  0.740122  0.528813 -0.589001 -1.278046
3     d  0.188695 -0.758872 -0.933237  0.955057 -0.570177
4     e  0.190794  1.978757  2.605967  0.683509  2.169552

In [25]:
df

          w         x         y         z       new
a  2.706850  0.628133  0.907969  0.503826  3.334983
b  0.651118 -0.319318 -0.848077  0.605965  0.331800
c -2.018168  0.740122  0.528813 -0.589001 -1.278046
d  0.188695 -0.758872 -0.933237  0.955057 -0.570177
e  0.190794  1.978757  2.605967  0.683509  2.169552

In [26]:
new = 'wa ab wy xy yw'.split()

In [27]:
new

['wa', 'ab', 'wy', 'xy', 'yw']

In [28]:
df['state'] = new

In [29]:
df

          w         x         y         z       new state
a  2.706850  0.628133  0.907969  0.503826  3.334983    wa
b  0.651118 -0.319318 -0.848077  0.605965  0.331800    ab
c -2.018168  0.740122  0.528813 -0.589001 -1.278046    wy
d  0.188695 -0.758872 -0.933237  0.955057 -0.570177    xy
e  0.190794  1.978757  2.605967  0.683509  2.169552    yw

In [30]:
df.set_index('state')

              w         x         y         z       new
state
wa     2.706850  0.628133  0.907969  0.503826  3.334983
ab     0.651118 -0.319318 -0.848077  0.605965  0.331800
wy    -2.018168  0.740122  0.528813 -0.589001 -1.278046
xy     0.188695 -0.758872 -0.933237  0.955057 -0.570177
yw     0.190794  1.978757  2.605967  0.683509  2.169552



## Data Frame - 2

In [31]:
import numpy as np

In [32]:
import pandas as pd

In [33]:
# index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hire_index = list(zip(outside,inside))
hire_index = pd.MultiIndex.from_tuples(hire_index)

In [34]:
df = pd.DataFrame(randn(6,2),hire_index,['A','B'])

In [35]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [36]:
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [37]:
df.iloc[1]

A   -1.706086
B   -1.159119
Name: (G1, 2), dtype: float64

In [38]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [39]:
df.loc['G2'].loc[2]['B']

0.07295967531703869

## Pandas-Missing Data

In [40]:
import numpy as np

In [41]:
import pandas as pd

In [42]:
d = {'a':[1,2,np.nan],'b':[5,np.nan,np.nan],'c':[1,2,3]}

In [43]:
df = pd.DataFrame(d)

In [44]:
df

     a    b  c
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [45]:
df.loc[2].loc['c']

3.0

In [46]:
df.dropna()

     a    b  c
0  1.0  5.0  1

In [47]:
df.dropna(thresh=2)

     a    b  c
0  1.0  5.0  1
1  2.0  NaN  2

In [48]:
df.fillna(value='Full value')

            a           b  c
0         1.0         5.0  1
1         2.0  Full value  2
2  Full value  Full value  3

In [49]:
df['a'].fillna(value=df['a'].mean())

0    1.0
1    2.0
2    1.5
Name: a, dtype: float64

## Pandas - Groupby

In [50]:
import numpy as np

In [51]:
import pandas as pd

In [52]:
Data = {'Company':['Amazon','filpkart','Snapdeal','Clubfacory','Shopcluse'],
       'person':['Rahul','kapil','Dinesh','Deepak','Atul'],
       'Salse':[220,200,190,176,191]}

In [53]:
df = pd.DataFrame(Data)

In [54]:
df

      Company  person  Salse
0      Amazon   Rahul    220
1    filpkart   kapil    200
2    Snapdeal  Dinesh    190
3  Clubfacory  Deepak    176
4   Shopcluse    Atul    191

In [55]:
byCompany = df.groupby('Company')

In [56]:
byCompany.mean()

            Salse
Company
Amazon      220.0
Clubfacory  176.0
Shopcluse   191.0
Snapdeal    190.0
filpkart    200.0

In [57]:
byCompany.sum().loc['Amazon']

Salse    220
Name: Amazon, dtype: int64

In [58]:
df.groupby('Company').count()

            person  Salse
Company
Amazon           1      1
Clubfacory       1      1
Shopcluse        1      1
Snapdeal         1      1
filpkart         1      1

In [59]:
df.groupby('Company').max()

            person  Salse
Company
Amazon       Rahul    220
Clubfacory  Deepak    176
Shopcluse     Atul    191
Snapdeal    Dinesh    190
filpkart     kapil    200

In [60]:
df.groupby('Company').describe()

           Salse
           count   mean std    min    25%    50%    75%    max
Company
Amazon       1.0  220.0 NaN  220.0  220.0  220.0  220.0  220.0
Clubfacory   1.0  176.0 NaN  176.0  176.0  176.0  176.0  176.0
Shopcluse    1.0  191.0 NaN  191.0  191.0  191.0  191.0  191.0
Snapdeal     1.0  190.0 NaN  190.0  190.0  190.0  190.0  190.0
filpkart     1.0  200.0 NaN  200.0  200.0  200.0  200.0  200.0

In [61]:
df.groupby('Company').describe().transpose()#['Amazon']

Company      Amazon  Clubfacory  Shopcluse  Snapdeal  filpkart
Salse count     1.0         1.0        1.0       1.0       1.0
      mean    220.0       176.0      191.0     190.0     200.0
      std       NaN         NaN        NaN       NaN       NaN
      min     220.0       176.0      191.0     190.0     200.0
      25%     220.0       176.0      191.0     190.0     200.0
      50%     220.0       176.0      191.0     190.0     200.0
      75%     220.0       176.0      191.0     190.0     200.0
      max     220.0       176.0      191.0     190.0     200.0

## Pandas  - Merging,joining and concatenating

In [62]:
import pandas as pd

In [63]:
Data1 = pd.DataFrame({'A':['A0','A1','A2','A3','A4'],
        'B':['B0','B1','B2','B3','B4'],
        'C':['C0','C1','C2','C3','C4'],
         'D':['D0','C1','C2','C3','C4']},
         index=[0 , 1, 2, 3, 4])

In [64]:
Data2 = pd.DataFrame({'A':['A5','A6','A7','A8','A9'],
        'B':['B5','B6','B7','B8','B9'],
        'C':['C5','C6','C7','C8','C9'],
         'D':['D5','C6','C7','C8','C9']},
         index=[5 , 6, 7, 8, 9])

In [65]:
Data3 = pd.DataFrame({'A':['A10','A11','A12','A13','A14'],
        'B':['B10','B11','B12','B13','B14'],
        'C':['C10','C11','C12','C13','C14'],
         'D':['D10','C11','C12','C13','C14']},
         index=[10 , 11, 12, 13, 14])

In [66]:
Data1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  C1
2  A2  B2  C2  C2
3  A3  B3  C3  C3
4  A4  B4  C4  C4

In [67]:
Data2

    A   B   C   D
5  A5  B5  C5  D5
6  A6  B6  C6  C6
7  A7  B7  C7  C7
8  A8  B8  C8  C8
9  A9  B9  C9  C9

In [68]:
Data3

      A    B    C    D
10  A10  B10  C10  D10
11  A11  B11  C11  C11
12  A12  B12  C12  C12
13  A13  B13  C13  C13
14  A14  B14  C14  C14

## concatenating

In [69]:
pd.concat([Data1,Data2,Data3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   C1
2    A2   B2   C2   C2
3    A3   B3   C3   C3
4    A4   B4   C4   C4
5    A5   B5   C5   D5
6    A6   B6   C6   C6
7    A7   B7   C7   C7
8    A8   B8   C8   C8
9    A9   B9   C9   C9
10  A10  B10  C10  D10
11  A11  B11  C11  C11
12  A12  B12  C12  C12
13  A13  B13  C13  C13
14  A14  B14  C14  C14

In [70]:
pd.concat([Data1,Data2,Data3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   C1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   C2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   C3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4    A4   B4   C4   C4  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   C6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   C7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN   A8   B8   C8   C8  NaN  NaN  NaN  NaN
9   NaN  NaN  NaN  NaN   A9   B9   C9   C9  NaN  NaN  NaN  NaN
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  C11
12  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A12  B12  C12  C12
13  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A13  B13  C13  C13
14  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A14  B14  C14  C14

In [71]:
df.columns

Index(['Company', 'person', 'Salse'], dtype='object')

In [72]:
df.index

RangeIndex(start=0, stop=5, step=1)

## Data Input and Output

.csv
.HTML
.Excel
.SQL

In [73]:
import pandas as pd

In [74]:
pd.read_csv('bc.csv')

FileNotFoundError: [Errno 2] No such file or directory: 'bc.csv'

In [ ]:
df

      Company  person  Salse
0      Amazon   Rahul    220
1    filpkart   kapil    200
2    Snapdeal  Dinesh    190
3  Clubfacory  Deepak    176
4   Shopcluse    Atul    191

In [ ]:
df.to_csv('myoutput')

In [ ]:
pd.read_csv('myoutput')

   Unnamed: 0     Company  person  Salse
0           0      Amazon   Rahul    220
1           1    filpkart   kapil    200
2           2    Snapdeal  Dinesh    190
3           3  Clubfacory  Deepak    176
4           4   Shopcluse    Atul    191

In [ ]:
import pandas as pd

In [ ]:
Data1 = pd.DataFrame({'A':['A0','A1','A2','A3','A4'],
        'B':['B0','B1','B2','B3','B4'],
        'C':['C0','C1','C2','C3','C4'],
         'D':['D0','C1','C2','C3','C4']},
         index=[0 , 1, 2, 3, 4])
Data2 = pd.DataFrame({'A':['A0','A1','A2','A3','A4'],
        'B':['B0','B1','B2','B3','B4'],
        'C':['C0','C1','C2','C3','C4'],
         'D':['D0','C1','C2','C3','C4']},
         index=[0 , 1, 2, 3, 4])
Data3 = pd.DataFrame({'A':['A0','A1','A2','A3','A4'],
        'B':['B0','B1','B2','B3','B4'],
        'C':['C0','C1','C2','C3','C4'],
         'D':['D0','C1','C2','C3','C4']},
         index=[0 , 1, 2, 3, 4])

In [ ]:
print([Data1,Data2,Data3])

[    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  C1
2  A2  B2  C2  C2
3  A3  B3  C3  C3
4  A4  B4  C4  C4,     A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  C1
2  A2  B2  C2  C2
3  A3  B3  C3  C3
4  A4  B4  C4  C4,     A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  C1
2  A2  B2  C2  C2
3  A3  B3  C3  C3
4  A4  B4  C4  C4]